Repository: AqtraPlatform/Docs
Catalog: locale/*/LC_MESSAGES/app-develop/data-flow-components/get-entity-by-*.po
Languages: id

source: Основные сведения
id: General information

source: Шаг "Get Entity by ID" предназначен для получения элемента данных компоненты по его уникальному идентификатору (ID). Этот шаг обычно используется в комбинации с шагами, такими как "Lookup" или "Update Entry", которые возвращают ID, пригодный для использования в данном шаге. <br>
id: The “Get Entity by ID” step is used to get a component item by its unique identifier (ID). This step is usually used in combination with other steps, such as “Lookup” or “Update Entry”, which return an ID that is suitable for this step. <br>

source: Параметры
id: Parameters

source: **Настройки Шага:**
id: **Step Settings:**

source: Поле настройки
id: Setting Field

source: Варианты значений
id: Value Options

source: Назначение
id: Purpose

source: Наименование шага
id: Name of the step

source: Выбор предыдущего шага
id: Selecting the previous step

source: Поле, содержащее ID для поиска
id: Field containing the ID to be searched

source: Поле, куда будет записан результат
id: Field where the result will be recorded

source: Компонент, в котором осуществляется поиск
id: Component that is being searched

source: Кейсы
id: Cases

source: **Поиск данных по ID**: Используется для точного извлечения конкретной записи по ID из компонента. <br>
id: **Data Search by ID**: Used to accurately retrieve a specific entry by using the ID from the component. <br>

source: Исключения
id: Exceptions

source: **Зависимость от точности ID**: Необходимо точное указание и наличие соответствующего ID в исходных данных для успешного выполнения запроса.
id: **Dependency on ID Accuracy**: The exact ID must be specified and available in the source data in order for the query to be successful.

source: **Обработка несоответствий**: В случае отсутствия записи с указанным ID, шаг может вернуть пустой результат. <br>
id: **Handling Inconsistencies**: If there is no entry with the specified ID, the step may return an empty result.

source: Вариант применения
id: Application scenario

source: Этот компонент предоставляет возможность добавления поля типа каталога и создания датафлоу для получения сущности по ее идентификатору. Поле типа каталога размещается на странице для выбора соответствующего значения из каталога. Датафлоу включает шаг Get action model для инициализации, шаг Get entity by id для получения сущности по идентификатору, используя выбранное значение из каталога, и шаг Write response для вывода результата.
id: This component allows adding a catalog-type field and creating a data flow to retrieve an entity by its identifier. The catalog-type field is placed on the page for selecting the corresponding value from the catalog. The data flow includes a 'Get action model' step for initialization, a 'Get entity by id' step for retrieving the entity by identifier using the selected value from the catalog, and a 'Write response' step for outputting the result.

source: Конфигурацию компонента можно скачать [здесь](https://drive.google.com/file/d/1eCxoYHKg0Zl8APxnUMRA9qmpqNkrtfuW/view?usp=sharing).
id: You can download the component configuration [here](https://drive.google.com/file/d/1eCxoYHKg0Zl8APxnUMRA9qmpqNkrtfuW/view?usp=sharing).
